k6/modifying/load.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: k6/modifying/load.js
     output: -

  scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
           * default: Up to 200 looping VUs for 30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m30.9s), 000/200 VUs, 3104 complete and 0 interrupted iterations
default ✓ [======================================] 000/200 VUs  30s

     ✓ logged in successfully
     ✓ updated member

     checks.........................: 100.00% ✓ 6208       ✗ 0
     data_received..................: 3.3 MB  108 kB/s
     data_sent......................: 1.9 MB  62 kB/s
     http_req_blocked...............: avg=974.56µs min=1µs    med=5µs     max=275.77ms p(90)=9µs     p(95)=14µs
     http_req_connecting............: avg=345.05µs min=0s     med=0s      max=89.17ms  p(90)=0s      p(95)=0s
   ✓ http_req_duration..............: avg=17.46ms  min=9.72ms med=13.88ms max=105.06ms p(90)=28.07ms p(95)=34.66ms
       { expected_response:true }...: avg=17.8ms   min=9.72ms med=13.97ms max=105.06ms p(90)=29.07ms p(95)=35.65ms
     http_req_failed................: 50.00%  ✓ 3104       ✗ 3104
     http_req_receiving.............: avg=74.7µs   min=18µs   med=69µs    max=355µs    p(90)=118µs   p(95)=138µs
     http_req_sending...............: avg=34.35µs  min=7µs    med=30µs    max=843µs    p(90)=50µs    p(95)=65µs
     http_req_tls_handshaking.......: avg=619.29µs min=0s     med=0s      max=266.55ms p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=17.35ms  min=9.58ms med=13.76ms max=104.97ms p(90)=27.99ms p(95)=34.57ms
     http_reqs......................: 6208    200.885085/s
     iteration_duration.............: avg=1.03s    min=1.02s  med=1.03s   max=1.32s    p(90)=1.05s   p(95)=1.06s
     iterations.....................: 3104    100.442543/s
     vus............................: 13      min=10       max=199
     vus_max........................: 200     min=200      max=200