k6/modifying/stress.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: k6/modifying/stress.js
     output: -

  scenarios: (100.00%) 1 scenario, 250 max VUs, 1m45s max duration (incl. graceful stop):
           * default: Up to 250 looping VUs for 1m15s over 10 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✗ logged in successfully
      ↳  59% — ✓ 8700 / ✗ 6033
     ✓ updated member

     checks.........................: 74.25% ✓ 17400      ✗ 6033
     data_received..................: 7.9 MB 104 kB/s
     data_sent......................: 5.3 MB 70 kB/s
     http_req_blocked...............: avg=309.04µs min=0s      med=6µs     max=258.2ms  p(90)=8µs      p(95)=9µs
     http_req_connecting............: avg=105.04µs min=0s      med=0s      max=92.66ms  p(90)=0s       p(95)=0s
   ✗ http_req_duration..............: avg=33.47ms  min=0s      med=22.82ms max=380.42ms p(90)=85.7ms   p(95)=113.12ms
       { expected_response:true }...: avg=46.54ms  min=12.74ms med=32.44ms max=348.71ms p(90)=102.08ms p(95)=122.73ms
     http_req_failed................: 62.87% ✓ 14733      ✗ 8700
     http_req_receiving.............: avg=70µs     min=0s      med=83µs    max=1.29ms   p(90)=118µs    p(95)=134µs
     http_req_sending...............: avg=29.61µs  min=0s      med=34µs    max=958µs    p(90)=48µs     p(95)=54µs
     http_req_tls_handshaking.......: avg=197.56µs min=0s      med=0s      max=251.45ms p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=33.37ms  min=0s      med=22.68ms max=380.19ms p(90)=85.57ms  p(95)=113.02ms
     http_reqs......................: 23433  309.78026/s
     iteration_duration.............: avg=645.06ms min=78.94µs med=1.03s   max=1.6s     p(90)=1.15s    p(95)=1.21s
     iterations.....................: 14733  194.767745/s
     vus............................: 12     min=10       max=250
     vus_max........................: 250    min=250      max=250